# Implementing Reflection Pattern

- Implementation of reflection pattern in code & use it to improve data visualization

In [1]:
import re
import json
import myutils

## Exploratory Data Analysis (EDA)

In [2]:
df = myutils.load_and_prepare_data("data/coffee_sales.csv")
df.sample(n=5)

,date,time,cash_type,card,price,coffee_name,quarter,month,year
325,2024-04-19,07:06,card,ANON-0000-0000-0001,3.870,Latte,2,4,2024
252,2024-04-08,10:38,cash,NaN,2.500,Espresso,2,4,2024
3472,2025-03-12,13:36,card,ANON-0000-0000-1281,3.576,Cappuccino,1,3,2025
2787,2025-01-15,16:23,card,ANON-0000-0000-1105,3.576,Latte,1,1,2025
3380,2025-03-05,10:46,card,ANON-0000-0000-1191,3.576,Latte,1,3,2025

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3636 entries, 0 to 3635
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         3636 non-null   datetime64[ns]
 1   time         3636 non-null   object
 2   cash_type    3636 non-null   object
 3   card         3547 non-null   object
 4   price        3636 non-null   float64
 5   coffee_name  3636 non-null   object
 6   quarter      3636 non-null   int32
 7   month        3636 non-null   int32
 8   year         3636 non-null   int32
dtypes: datetime64[ns](1), float64(1), int32(3), object(4)
memory usage: 213.2+ KB

In [4]:
df.isna().sum()

date            0
time            0
cash_type       0
card           89
price           0
coffee_name     0
quarter         0
month           0
year            0
dtype: int64

In [6]:
display(df[df.isna().any(axis=1)])

,date,time,cash_type,card,price,coffee_name,quarter,month,year
12,2024-03-02,08:52,cash,NaN,4.0,Latte,1,3,2024
18,2024-03-03,07:00,cash,NaN,4.0,Latte,1,3,2024
41,2024-03-06,08:42,cash,NaN,3.5,Americano with Milk,1,3,2024
46,2024-03-07,11:01,cash,NaN,4.0,Latte,1,3,2024
49,2024-03-07,14:30,cash,NaN,4.0,Latte,1,3,2024
...,...,...,...,...,...,...,...,...,...
657,2024-05-31,10:17,cash,NaN,3.9,Latte,2,5,2024
677,2024-06-01,15:56,cash,NaN,3.9,Cocoa,2,6,2024
685,2024-06-02,16:01,cash,NaN,3.4,Americano with Milk,2,6,2024
691,2024-06-03,14:11,cash,NaN,3.4,Americano with Milk,2,6,2024
692,2024-06-03,15:45,cash,NaN,3.4,Americano with Milk,2,6,2024

In [15]:
df.describe()

,date,price,quarter,month,year
count,3636,3636.000000,3636.000000,3636.000000,3636.000000
mean,2024-09-30 11:56:02.376237568,3.174686,2.437844,6.394664,2024.259351
min,2024-03-01 00:00:00,1.812000,1.000000,1.000000,2024.000000
25%,2024-07-03 00:00:00,2.792000,1.000000,3.000000,2024.000000
50%,2024-10-06 12:00:00,3.282000,2.000000,6.000000,2024.000000
75%,2025-01-08 00:00:00,3.576000,4.000000,10.000000,2025.000000
max,2025-03-23 00:00:00,4.000000,4.000000,12.000000,2025.000000
std,NaN,0.491993,1.182280,3.480686,0.438339